In [1]:
import pandas as pd

In [90]:
df = pd.read_csv('Final.csv')

In [91]:
df

         name   eng   hin   mth   sci
0      Ashish  45.0  65.0  76.0  78.0
1         Raj  65.0  45.0  65.0  76.0
2      Rohini  65.0  67.0   6.0  55.0
3      Rakesh  65.0  66.0  77.0  88.0
4      Rajesh  88.0  77.0  87.0  89.0
5      Manish  65.0  45.0  45.0  45.0
6       Manoj  45.0  66.0  88.0  56.0
7       Suraj  55.0  45.0  76.0  87.0
8       Sumit  66.0  77.0  45.0  89.0
9      Ratish  66.0  55.0  66.0  45.0
10    Tanisha  77.0  66.0  56.0  87.0
11  Anonymous  98.0  89.0  98.0  88.0
12  Anonymous  22.0  23.0  34.0  32.0

In [25]:
def typecast(col_name):

    lst = []
    for i in df[col_name]:
        lst.append(int(i))    
    df[col_name] = lst

In [26]:
typecast('eng')
typecast('mth')
typecast('hin')
typecast('sci')

In [27]:
df

         name  eng  hin  mth  sci
0      Ashish   45   65   76   78
1         Raj   65   45   65   76
2      Rohini   65   67    6   55
3      Rakesh   65   66   77   88
4      Rajesh   88   77   87   89
5      Manish   65   45   45   45
6       Manoj   45   66   88   56
7       Suraj   55   45   76   87
8       Sumit   66   77   45   89
9      Ratish   66   55   66   45
10    Tanisha   77   66   56   87
11  Anonymous   98   89   98   88
12  Anonymous   22   23   34   32

## Adding New data into the dataframe

In [60]:
df.iloc[ 1 , 1: ].sum()

251

In [67]:
total = []
avg = []

for i in range(len(df)):
    total.append(df.iloc[i, 1:].sum())
    avg.append(df.iloc[i, 1:].sum()/4)

In [68]:
total

[264, 251, 193, 296, 341, 200, 255, 263, 277, 232, 286, 373, 111]

In [69]:
avg

[66.0,
 62.75,
 48.25,
 74.0,
 85.25,
 50.0,
 63.75,
 65.75,
 69.25,
 58.0,
 71.5,
 93.25,
 27.75]

In [71]:
df['total'] = total

In [72]:
df['avg'] = avg

In [73]:
df

         name  eng  hin  mth  sci  total    avg
0      Ashish   45   65   76   78    264  66.00
1         Raj   65   45   65   76    251  62.75
2      Rohini   65   67    6   55    193  48.25
3      Rakesh   65   66   77   88    296  74.00
4      Rajesh   88   77   87   89    341  85.25
5      Manish   65   45   45   45    200  50.00
6       Manoj   45   66   88   56    255  63.75
7       Suraj   55   45   76   87    263  65.75
8       Sumit   66   77   45   89    277  69.25
9      Ratish   66   55   66   45    232  58.00
10    Tanisha   77   66   56   87    286  71.50
11  Anonymous   98   89   98   88    373  93.25
12  Anonymous   22   23   34   32    111  27.75

## Sorting Students data based on marks

In [80]:
df_pr = df.sort_values(by = 'total', ascending = False).head()

## Toppers in Exam based on Marks

In [83]:
df_pr.to_csv('Topper_in_Exam.csv',index = False)

## Toppers in English exam based on marks

In [84]:
df_pr = df.sort_values(by = 'eng', ascending = False).head()
df_pr.to_csv('Topper_in_English.csv',index = False)

## Toppers in Hindi exam based on marks

In [85]:
df_pr = df.sort_values(by = 'hin', ascending = False).head()
df_pr.to_csv('Topper_in_Hindi.csv',index = False)

## Toppers in Maths exam based on marks

In [86]:
df_pr = df.sort_values(by = 'mth', ascending = False).head()
df_pr.to_csv('Topper_in_Maths.csv',index = False)

## Toppers in Science exam based on marks

In [87]:
df_pr = df.sort_values(by = 'sci', ascending = False).head()
df_pr.to_csv('Topper_in_Science.csv',index = False)

## Saving Final Dataset

In [89]:
df.to_csv('Marks.csv',index = False)